---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpenStringerConflictNosing
source: html/a8a9a859-4a54-b761-b4e2-c83a09f4a541.htm
---
# Autodesk.Revit.DB.BuiltInFailures.OpeningFailures.OpenStringerConflictNosing Property

Open stringer can't be created for selected nosing profile. Set nosing profile to default to get open stringers created.

## Syntax (C#)
```csharp
public static FailureDefinitionId OpenStringerConflictNosing { get; }
```